const cssQuestions = [
  {
    title: 'Css - це ... дайте технічну відповідь?',
    variants: [
      'мова програмування',
      'технологія для стилізації нашого сайти',
      'це спеціальна мова стилю сторінок, що використовується для опису їхнього зовнішнього вигляду',
    ],
    correct: 2,
  },
  {
    title: 'розшифруйте абривіатуру Css?',
    variants: [
      'Cascading Style Sheets',
      'Cascading Select Style',
      'Counter Strike Style',
    ],
    correct: 0,
  },
  {
    title: 'Для чого призначений селектор?',
    variants: [
      'це частина CSS-правила, яка повідомляє Html, до якого сайту буде застосований CSS стиль',
      'з допомогою селекторів ми вивчаємо синтаксис css',
      'це частина CSS-правила, яка повідомляє браузеру, до якого елементу веб-сторінки буде застосований CSS стиль',
    ],
    correct: 2,
  },
  {
    title: 'В чому різниця відступів margin і padding?',
    variants: [
      'різниці не має',
      'padding - це відступ від вмісту до краю блоку, margin - це відстань від одного блоку до іншого, міжблоковий простір',
      'margin - це відступ від вмісту до краю блоку, padding - це відстань від одного блоку до іншого, міжблоковий простір',
    ],
    correct: 1,
  },
  {
    title: 'які свойства css мають наслідування?',
    variants: ['color', 'text-align', 'всі варіанти правдиві'],
    correct: 2,
  },
];

export { cssQuestions };
