const htmlQuestions = [
  {
    title: 'HTML - це ... ?',
    variants: [
      'мова програмування',
      'мова розмітки гіпертексту',
      '"скелет" нашого сайту',
    ],
    correct: 1,
  },
  {
    title: 'Як розшифровується HTML?',
    variants: [
      'HyperText Markup Language',
      'HyperText Master Layout',
      'Hyperlinks Marquee Lazy',
    ],
    correct: 0,
  },
  {
    title: 'для чого потрібен head в HTML?',
    variants: [
      'це звичайний семантичний тег, особливої ролі він не робить',
      'тег head призначений для зберігання службової інформації про сторінку',
      'оба варіанти прадиві',
    ],
    correct: 1,
  },
  {
    title: 'для чого нам потрібні семантичні теги?',
    variants: [
      'щоб додати нам роботи',
      'вони ділять сторінку на логічні блоки, створюють певну логічну структуру',
      'для того, щоб користувачі сайту могли користуватися зручним сайтом',
    ],
    correct: 1,
  },
  {
    title: 'Що таке тег у HTML5?',
    variants: [
      'Тег - це спеціальний вміст у HTML5, який оточений кутовою дужкою ()',
      'це функція',
      'Місцеве сховище',
    ],
    correct: 0,
  },
];

export { htmlQuestions };
