const reactQuestions = [
  {
    title: 'React - це ... ?',
    variants: ['бібліотека', 'фреймворк', 'приложенія'],
    correct: 0,
  },
  {
    title: 'У чому різниця між елементом та компонентом?',
    variants: [
      'Компонент описує те, що ви хочете побачити на екрані,елемент React є самодостатніми елементами, які можна використовувати на сторінці будь-яку кількість разів.',
      'Елемент описує те, що ви хочете побачити на екрані,компоненти React є самодостатніми елементами, які можна використовувати на сторінці будь-яку кількість разів.',
      'У них немає різниці',
    ],
    correct: 1,
  },
  {
    title: 'Hooks - це... ?',
    variants: [
      'API, що дозволяє писати функціональні компоненти зі станом та використовувати інші можливості реакту без написання класів.',
      "Об'єкт",
      'Це просто HTML код',
    ],
    correct: 0,
  },
  {
    title: 'Що таке SPA у React?',
    variants: [
      'SPA (select pixel application) перекладається як “виберіть піксельну програму”, дуже поширений спосіб програмування веб-сайтів у наші дні',
      'SPA новий алгоритм розробки сайтів',
      'SPA (single page application) перекладається як “односторінковий додаток”, дуже поширений спосіб програмування веб-сайтів у наші дні: ідея в тому, що сайт завантажує весь потрібний для досвіду користувача HTML/JS відразу ж при першому відвідуванні головної сторінки, а при наступних переходах по сторінках браузер ...\n',
    ],
    correct: 2,
  },
  {
    title: 'Virtual DOM у React - це...?',
    variants: [
      'Virtual DOM — це облегчена версія DOM браузера',
      "Virtual DOM — це концепція програмування, в якій ідеальне або «віртуальне» представлення інтерфейсу користувача зберігається в пам'яті і синхронізується з «справжнім» DOM за допомогою бібліотеки, такої як ReactDOM. Цей процес називається узгодженням.\n",
      'Virtual DOM — це концепція програмування, в якій Virtual DOM замінює DOM браузера',
    ],
    correct: 1,
  },
];

export { reactQuestions };
