const reactQuestions = [
  {
    title: 'React - це ... ?',
    variants: ['бібліотека', 'фреймворк', 'приложенія'],
    correct: 0,
  },
  {
    title: 'У чому різниця між елементом та компонентом?',
    variants: [
      'Компонент описує те, що ви хочете побачити на екрані,елемент React є самодостатніми елементами, які можна використовувати на сторінці будь-яку кількість разів.',
      'Елемент описує те, що ви хочете побачити на екрані,компоненти React є самодостатніми елементами, які можна використовувати на сторінці будь-яку кількість разів.',
      'У них немає різниці',
    ],
    correct: 1,
  },
  {
    title: 'Hooks - це... ?',
    variants: [
      'API, що дозволяє писати функціональні компоненти зі станом та використовувати інші можливості реакту без написання класів.',
      'Объект',
      'Це просто HTML код',
    ],
    correct: 0,
  },
];

export { reactQuestions };
